@file:Suppress("UNUSED_PARAMETER")
package lesson5.task1

import kotlin.text.StringBuilder

/**
 * Пример
 *
 * Время представлено строкой вида "11:34:45", содержащей часы, минуты и секунды, разделённые двоеточием.
 * Разобрать эту строку и рассчитать количество секунд, прошедшее с начала дня.
 */
fun timeStrToSeconds(str: String): Int {
    val parts = str.split(":")
    var result = 0
    for (part in parts) {
        val number = part.toInt()
        result = result * 60 + number
    }
    return result
}

/**
 * Пример
 *
 * Дано число n от 0 до 99.
 * Вернуть его же в виде двухсимвольной строки, от "00" до "99"
 */
fun twoDigitStr(n: Int) = if (n in 0..9) "0$n" else "$n"

/**
 * Пример
 *
 * Дано seconds -- время в секундах, прошедшее с начала дня.
 * Вернуть текущее время в виде строки в формате "ЧЧ:ММ:СС".
 */
fun timeSecondsToStr(seconds: Int): String {
    val hour = seconds / 3600
    val minute = (seconds % 3600) / 60
    val second = seconds % 60
    return String.format("%02d:%02d:%02d", hour, minute, second)
}

/**
 * Пример: консольный ввод
 */
fun main(args: Array<String>) {
    /*
    println("Введите время в формате ЧЧ:ММ:СС")
    val line = readLine()
    if (line != null) {
        val seconds = timeStrToSeconds(line)
        if (seconds == -1) {
            println("Введённая строка $line не соответствует формату ЧЧ:ММ:СС")
        }
        else {
            println("Прошло секунд с начала суток: $seconds")
        }
    }
    else {
        println("Достигнут <конец файла> в процессе чтения строки. Программа прервана")
    }
    */
}

/**
 * Средняя
 *
 * Дата представлена строкой вида "15 июля 2016".
 * Перевести её в цифровой формат "15.07.2016".
 * День и месяц всегда представлять двумя цифрами, например: 03.04.2011.
 * При неверном формате входной строки вернуть пустую строку
 */
val month = listOf<String>("января", "февраля", "марта", "апреля", "мая", "июня", "июля",
        "августа", "сентября", "октября", "ноября", "декабря")

fun dateStrToDigit(str: String): String{
    try {
        val list = str.split(" ")
        if (list.size != 3) throw Exception("неверный формат строки")
        if (list[1] in month)
            return String.format("%02d.%02d.%d", list[0].toInt(), month.indexOf(list[1])+1, list[2].toInt())
        else
            throw Exception("неверный формат месяца")
    }
    catch (e: Exception){
        return ""
    }
}

/**
 * Средняя
 *
 * Дата представлена строкой вида "15.07.2016".
 * Перевести её в строковый формат вида "15 июля 2016".
 * При неверном формате входной строки вернуть пустую строку
 */
fun dateDigitToStr(digital: String): String{
    try {
        val list = digital.split(".")
        if (list.size != 3) throw Exception("неверный формат строки")
        return String.format("%d %s %d", list[0].toInt(), month[list[1].toInt()-1], list[2].toInt())
    }
    catch (e: Exception){
        return ""
    }
}

/**
 * Средняя
 *
 * Номер телефона задан строкой вида "+7 (921) 123-45-67".
 * Префикс (+7) может отсутствовать, код города (в скобках) также может отсутствовать.
 * Может присутствовать неограниченное количество пробелов и чёрточек,
 * например, номер 12 --  34- 5 -- 67 -98 тоже следует считать легальным.
 * Перевести номер в формат без скобок, пробелов и чёрточек (но с +), например,
 * "+79211234567" или "123456789" для приведённых примеров.
 * Все символы в номере, кроме цифр, пробелов и +-(), считать недопустимыми.
 * При неверном формате вернуть пустую строку
 */
fun flattenPhoneNumber(phone: String): String{
    try {
        val s = StringBuilder("")
        for (ch in phone) {
            // не обрабатываем символ, если попадается скобка или черточка
            if (ch != ' ' && ch != '-' && ch != '(' && ch != ')'){
                // если не цифра и не плюс, то неверный формат
                if ((ch !in '0'..'9') && (ch != '+'))
                    throw Exception("неверный формат")
                else s.append(ch)
            }
        }
        return s.toString()
    }
    catch (x: Exception){
        return ""
    }
}

/**
 * Средняя
 *
 * Результаты спортсмена на соревнованиях в прыжках в длину представлены строкой вида
 * "706 - % 717 % 703".
 * В строке могут присутствовать числа, черточки - и знаки процента %, разделённые пробелами;
 * число соответствует удачному прыжку, - пропущенной попытке, % заступу.
 * Прочитать строку и вернуть максимальное присутствующее в ней число (717 в примере).
 * При нарушении формата входной строки или при отсутствии в ней чисел, вернуть -1.
 */
fun bestLongJump(jumps: String): Int{
    val tempList = jumps.split(" ")
    val list = mutableListOf<Int>()
    for (elem in tempList){
        try{
            list.add(elem.toInt())
        }  /* если не преобразовалось в Int, проверяем, содержит ли строка
              корректные символы. если корректные - обрабатываем некст строку */
        catch (e: NumberFormatException){
            if (elem == "%" || elem == "-" || elem == "") continue
            else return -1
        }
    }
    if (list.isNotEmpty()){
        var max = list[0]
        for (i in 1 until list.size){
            if (list[i]>max)
                max = list[i]
        }
        return max
    }
    else return -1
}

/**
 * Сложная
 *
 * Результаты спортсмена на соревнованиях в прыжках в высоту представлены строкой вида
 * "220 + 224 %+ 228 %- 230 + 232 %%- 234 %".
 * Здесь + соответствует удачной попытке, % неудачной, - пропущенной.
 * Высота и соответствующие ей попытки разделяются пробелом.
 * Прочитать строку и вернуть максимальную взятую высоту (230 в примере).
 * При нарушении формата входной строки вернуть -1.
 */
fun bestHighJump(jumps: String): Int{
    try{
        var max = -1
        val list = jumps.split(" ")
        var a = list[0].toInt()       /* излишне, т.к. переприсваевается в цикле, но этим
            toInt() точно можно проверить корректность ввода, например, при строке "???" */
        for (i in 1 until list.size step 2){
            a = list[i-1].toInt()
            for (ch in list[i]){
                if ((ch=='+')||(ch=='-')||ch=='%'){
                    if ((ch=='+')&&(a>max)){
                        max = a
                        break
                    }
                }
                else throw Exception("встречен недопустимый символ")
            }
        }
        return max
    }
    catch (x: Exception){
        return -1
    }
}

/**
 * Сложная
 *
 * В строке представлено выражение вида "2 + 31 - 40 + 13",
 * использующее целые положительные числа, плюсы и минусы, разделённые пробелами.
 * Наличие двух знаков подряд "13 + + 10" или двух чисел подряд "1 2" не допускается.
 * Вернуть значение выражения (6 для примера).
 * Про нарушении формата входной строки бросить исключение IllegalArgumentException
 */
fun plusMinus(expression: String): Int{
    val list = expression.split(" ")
    var sum: Int
    try{
        sum = list[0].toInt()
        var i = 1
        while (i < list.size){
            i++
            if (i%2 == 0){
                when (list[i-1]){
                    "+" -> sum += list[i].toInt()
                    "-" -> sum -= list[i].toInt()
                    else -> throw NumberFormatException()
                }
            }
        }
    }
    catch(x: NumberFormatException){
        throw IllegalArgumentException()
    }
    return sum
}

/**
 * Сложная
 *
 * Строка состоит из набора слов, отделённых друг от друга одним пробелом.
 * Определить, имеются ли в строке повторяющиеся слова, идущие друг за другом.
 * Слова, отличающиеся только регистром, считать совпадающими.
 * Вернуть индекс начала первого повторяющегося слова, или -1, если повторов нет.
 * Пример: "Он пошёл в в школу" => результат 9 (индекс первого 'в')
 */
fun firstDuplicateIndex(str: String): Int{
    val list = str.toLowerCase().split(" ") // список слов
    val listIndex = mutableListOf<Int>() // список индексов первых букв
    var firstIndex = -1
    // прямое соответствие между списком слов и списком индексов
    for (i in 0 until str.length){
        if (firstIndex == -1) firstIndex = i
        if (i == str.length) listIndex.add(firstIndex)
        if (str[i] == ' ')
        {
            listIndex.add(firstIndex)
            firstIndex = -1
        }
    }
    for (i in 1 until list.size) {
        if (list[i] == list[i - 1])
            return listIndex[i-1]
    }
    return -1
}

/**
 * Сложная
 *
 * Строка содержит названия товаров и цены на них в формате вида
 * "Хлеб 39.9; Молоко 62.5; Курица 184.0; Конфеты 89.9".
 * То есть, название товара отделено от цены пробелом,
 * а цена отделена от названия следующего товара точкой с запятой и пробелом.
 * Вернуть название самого дорогого товара в списке (в примере это Курица),
 * или пустую строку при нарушении формата строки.
 * Все цены должны быть положительными
 */
fun mostExpensive(description: String): String{
    try {
        val listMain = description.split("; ") // список связок наименование-цена
        val listName = mutableListOf<String>() // список наименований
        val listCost = mutableListOf<Double>() // список цен

        /* проверка на верность формата ввода, заполнение списков */
        for (str in listMain) {
            val list = str.split(" ")
            listName.add(list[0])
            var dot = false // наличие точки в цене
            for (ch in list[1])
                if ((ch !in '0'..'9') && (ch != '.'))
                    throw Exception("неверный формат цены")
                else if (ch == '.') dot = true
            if (dot) listCost.add(list[1].toDouble())
        }
        /* проверка на прямое соответствие индексов списков наименований и цен,
           далее поиск наименования продукта с самой большой ценой */
        if ((listName.isNotEmpty()) && (listCost.isNotEmpty())
           && ((listCost.size + listName.size)%2 == 0 )){
            var max = 0
            for (i in 1 until listCost.size)
                if (listCost[i]>listCost[max]) max = i
            return listName[max]
        }
        else throw Exception("нет прямого соответствия между наименованием и ценой либо строка пуста")
    }
    catch (x: Exception) {
        return ""
    }
}

/**
 * Сложная
 *
 * Перевести число roman, заданное в римской системе счисления,
 * в десятичную систему и вернуть как результат.
 * Римские цифры: 1 = I, 4 = IV, 5 = V, 9 = IX, 10 = X, 40 = XL, 50 = L,
 * 90 = XC, 100 = C, 400 = CD, 500 = D, 900 = CM, 1000 = M.
 * Например: XXIII = 23, XLIV = 44, C = 100
 *
 * Вернуть -1, если roman не является корректным римским числом
 */
fun fromRoman(roman: String): Int = TODO()

/**
 * Очень сложная
 *
 * Имеется специальное устройство, представляющее собой
 * конвейер из cells ячеек (нумеруются от 0 до cells - 1 слева направо) и датчик, двигающийся над этим конвейером.
 * Строка commands содержит последовательность команд, выполняемых данным устройством, например +>+>+>+>+
 * Каждая команда кодируется одним специальным символом:
 *	> - сдвиг датчика вправо на 1 ячейку;
 *  < - сдвиг датчика влево на 1 ячейку;
 *	+ - увеличение значения в ячейке под датчиком на 1 ед.;
 *	- - уменьшение значения в ячейке под датчиком на 1 ед.;
 *	[ - если значение под датчиком равно 0, в качестве следующей команды следует воспринимать
 *  	не следующую по порядку, а идущую за соответствующей следующей командой ']' (с учётом вложенности);
 *	] - если значение под датчиком не равно 0, в качестве следующей команды следует воспринимать
 *  	не следующую по порядку, а идущую за соответствующей предыдущей командой '[' (с учётом вложенности);
 *      (комбинация [] имитирует цикл)
 *  пробел - пустая команда
 *
 * Изначально все ячейки заполнены значением 0 и датчик стоит на ячейке с номером N/2 (округлять вниз)
 *
 * После выполнения limit команд или всех команд из commands следует прекратить выполнение последовательности команд.
 * Учитываются все команды, в том числе несостоявшиеся переходы ("[" при значении под датчиком не равном 0 и "]" при
 * значении под датчиком равном 0) и пробелы.
 *
 * Вернуть список размера cells, содержащий элементы ячеек устройства после завершения выполнения последовательности.
 * Например, для 10 ячеек и командной строки +>+>+>+>+ результат должен быть 0,0,0,0,0,1,1,1,1,1
 *
 * Все прочие символы следует считать ошибочными и формировать исключение IllegalArgumentException.
 * То же исключение формируется, если у символов [ ] не оказывается пары.
 * Выход за границу конвейера также следует считать ошибкой и формировать исключение IllegalStateException.
 * Считать, что ошибочные символы и непарные скобки являются более приоритетной ошибкой чем выход за границу ленты,
 * то есть если в программе присутствует некорректный символ или непарная скобка, то должно быть выброшено
 * IllegalArgumentException.
 * IllegalArgumentException должен бросаться даже если ошибочная команда не была достигнута в ходе выполнения.
 *
 */
fun computeDeviceCells(cells: Int, commands: String, limit: Int): List<Int> = TODO()
